#include <iostream>
#include <string>
#include <algorithm>
#include <vector>
#include <cmath>

using namespace std;

int main()
{
	ios_base::sync_with_stdio(0); cin.tie(0); cout.tie(0);

	int N;
	cin >> N;

	/*
	 
	사람 3명:  1
	1 1 1
	1 0 1
	1 0 0

	사람 4명:  2
	1 1 1 1
	1 0 1 0
	1 0 0 0
	1 0 0 1

	사람 5명:  2
	1 1 1 1 1
	1 0 1 0 1
	1 0 0 0 1
	1 0 0 1 1
	1 0 0 1 0

	사람 6명:  2
	1 1 1 1 1 1
	1 0 1 0 1 0
	1 0 0 0 1 1
	1 0 0 1 1 1
	1 0 0 1 0 1
	1 0 0 1 0 0

	사람 7명:  2
	1 2 3 4 5 6 7
	1 1 1 1 1 1 1
	1 0 1 0 1 0 1
	1 0 0 0 1 1 1
	1 0 0 1 1 1 1
	1 0 0 1 0 1 1
	1 0 0 1 0 0 1
	1 0 0 1 0 0 0

	사람 8명: 2
	1 2 3 4 5 6 7 8
	1 1 1 1 1 1 1 1
	1 0 1 0 1 0 1 0
	1 0 0 0 1 1 1 0
	1 0 0 1 1 1 1 1
	1 0 0 1 0 1 1 1
	1 0 0 1 0 0 1 1
	1 0 0 1 0 0 0 1
	1 0 0 1 0 0 0 0

	사람 9명 : 3
	1 2 3 4 5 6 7 8 9
	1 1 1 1 1 1 1 1 1
	1 0 1 0 1 0 1 0 1
	1 0 0 0 1 1 1 0 0
	1 0 0 1 1 1 1 1 0
	1 0 0 1 0 1 1 1 0
	1 0 0 1 0 0 1 1 0
	1 0 0 1 0 0 0 1 0
	1 0 0 1 0 0 0 0 0
	1 0 0 1 0 0 0 0 1
	 */

	// 3*3 = 9 -> 3
	// 2*2 = 4 -> 2
	// 1*1 = 1 -> 1
	// 4*4 = 16-> 4
	// n번째 창문이 열려있으려면 열고 닫은 횟수가 홀수번이어야 함
	// 즉, n의 약수가 홀수개여야 하고, 약수가 홀수개인 수는 제곱수

	// N의 범위 1~21억

	int n = 1;
	while (n*n <= N)
		n++;

	cout << n - 1;

	return 0;
}